run/CFD3/system/forces
forces
{
    type 		forces;
    functionObjectLibs 	("libforces.so");
    outputControl 	timeStep;
    outputInterval 	1;
    patches 		(cylinder plate);
    pName               p;
    UName               U;
    rhoName 		rhoInf;
    log 		true;
    rhoInf 		1000;
    CofR 		( 0 0 0 );
}
